NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32ZG23/EFR32ZG23A010F512GM48.svd
        <register>
          <name>OUTCTRL</name>
          <description>No Description</description>
          <addressOffset>0x030</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7FDFF333</resetMask>
          <fields>
            <field>
              <name>MAINOUTENCH0</name>
              <description>CH0 Main Output Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAINOUTENCH1</name>
              <description>CH1 Main Output Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AUXOUTENCH0</name>
              <description>CH0 Alternative Output Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AUXOUTENCH1</name>
              <description>CH1 Alternative Output Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHORTCH0</name>
              <description>CH1 Main and Alternative Output Short</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHORTCH1</name>
              <description>CH0 Main and Alternative Output Short</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ABUSPORTSELCH0</name>
              <description>CH0 ABUS Port Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No GPIO Selected for CH0 ABUS Output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A Selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B Selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C Selected</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D Selected</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABUSPINSELCH0</name>
              <description>CH0 ABUS Pin Select</description>
              <bitOffset>15</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ABUSPORTSELCH1</name>
              <description>CH1 ABUS Port Select</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No GPIO Selected for CH1 ABUS Output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A Selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B Selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C Selected</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D Selected</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABUSPINSELCH1</name>
              <description>CH1 ABUS Pin Select</description>
              <bitOffset>25</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTTIMERCFG</name>
          <description>No Description</description>
          <addressOffset>0x034</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01FF83FF</resetMask>
          <fields>
            <field>
              <name>CH0OUTHOLDTIME</name>
              <description>CH0 Output Hold Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1OUTHOLDTIME</name>
              <description>CH1 Output Hold Time</description>
              <bitOffset>15</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
