NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32ZG23/EFR32ZG23A010F512GM48.svd
        <register>
          <name>STOPTRIGCTRL</name>
          <description>No Description</description>
          <addressOffset>0x044</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>TRACESEL</name>
              <description>Trace Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMBMODE</name>
              <description>Combination Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AND</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OR</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STARTTRIGENMASK</name>
          <description>No Description</description>
          <addressOffset>0x048</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENMASK</name>
              <description>Enable Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STARTTRIGREDMASK</name>
          <description>No Description</description>
          <addressOffset>0x04C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REDMASK</name>
              <description>Rising Edge Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STARTTRIGFEDMASK</name>
          <description>No Description</description>
          <addressOffset>0x050</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FEDMASK</name>
              <description>Falling Edge Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STARTTRIGLVL0MASK</name>
          <description>No Description</description>
          <addressOffset>0x054</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LVL0MASK</name>
              <description>Level 0 Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STARTTRIGLVL1MASK</name>
          <description>No Description</description>
          <addressOffset>0x058</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LVL1MASK</name>
              <description>Level 1 Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STOPTRIGENMASK</name>
          <description>No Description</description>
          <addressOffset>0x05C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENMASK</name>
              <description>Enable Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STOPTRIGREDMASK</name>
          <description>No Description</description>
          <addressOffset>0x060</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REDMASK</name>
              <description>Rising Edge Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STOPTRIGFEDMASK</name>
          <description>No Description</description>
          <addressOffset>0x064</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FEDMASK</name>
              <description>Falling Edge Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STOPTRIGLVL0MASK</name>
          <description>No Description</description>
          <addressOffset>0x068</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LVL0MASK</name>
              <description>Level 0 Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STOPTRIGLVL1MASK</name>
          <description>No Description</description>
          <addressOffset>0x06C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LVL1MASK</name>
              <description>Level 1 Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAPTURECTRL</name>
          <description>No Description</description>
          <addressOffset>0x070</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000501</resetValue>
          <resetMask>0x7FF7FFFF</resetMask>
          <fields>
            <field>
              <name>TRACESEL</name>
              <description>Trace Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATAWIDTH</name>
              <description>Data Width</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BIT1</name>
                  <description>1 bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT2</name>
                  <description>2 bits</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT4</name>
                  <description>4 bits</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT8</name>
                  <description>8 bits</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT16</name>
                  <description>16 bits</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT32</name>
                  <description>32 bits</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAROTATESIZE</name>
              <description>Data Rotate Size</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STARTMODE</name>
              <description>Start Mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MANUAL</name>
                  <description>In this mode, setting CMD.MODE=CAPTURE would start the capture</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START_TRIGGER</name>
                  <description>In this mode, a start-trigger(via STARTTRIGCTRL) would start the capture</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPMODE</name>
              <description>Stop Mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>Capture will continue to occur until another mode is configured</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUF_FULL</name>
                  <description>Capture will stop when the memory buffer is full. In this mode CAPTURESTOPDELAY has no effect</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_TRIGGER</name>
                  <description>Capture will stop when the stop-trigger event occurs or optionally after a CAPTURESTOPDELAY number of cycles/capture-events if configured</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_TRIGGER_FULL</name>
                  <description>Capture stops when either of the following conditions is met (in either of these conditions, CAPTURESTOPDELAY has no effect): BUF_FULL condition or STOP_TRIGGER condition</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COND</name>
              <description>Condition</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMED</name>
                  <description>Capture condition is based on the rate specified in CAPTURERATECTRL register within the active capture window</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START_TRIGGER</name>
                  <description>Capture condition is every start-trigger event in the active capture windo</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLAVE</name>
                  <description>Capture condition is every cycle when cap_event_in input is high</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPCONDPRI</name>
              <description>Stop Condition Priority</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITEDIS</name>
              <description>Write Memory Disable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATAOUTEN</name>
              <description>Port Interface Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATAOUTDSHIFT</name>
              <description>Port Interface Shift</description>
              <bitOffset>25</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAPTURESTARTDELAY</name>
          <description>No Description</description>
          <addressOffset>0x074</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DELAY</name>
              <description>Start Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAPTURESTOPDELAY</name>
          <description>No Description</description>
          <addressOffset>0x078</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DELAY</name>
              <description>Stop Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAPTURERATECTRL</name>
          <description>No Description</description>
          <addressOffset>0x07C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>RATE</name>
              <description>Capture Rate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLAYBACKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000014</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>Playback Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>Playback starts at BUF0_BASE and stops at BUF1_BASE + BUF1_LIMITOFFSET</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP</name>
                  <description>Playback starts at BUF0_BASE and loops/wraps continuously until CTRL.MODE != PLAYBACK (this can be supported in single or double-buffer modes)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COND</name>
              <description>Playback Condition</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>START_TRIGGER</name>
                  <description>Playback event occurs at every start-trigger event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMED</name>
                  <description>Playback event occurs based on rate defined in PLAYBACL_RATE_CTRL</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAWIDTH</name>
              <description>Playback Data Width</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BIT1</name>
                  <description>1 bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT2</name>
                  <description>2 bits</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT4</name>
                  <description>4 bits</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT8</name>
                  <description>8 bits</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT16</name>
                  <description>16 bits</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT32</name>
                  <description>32 bits</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PLAYBACKRATECTRL</name>
          <description>No Description</description>
          <addressOffset>0x084</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>RATE</name>
              <description>Playback Rate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTCNTRCTRL</name>
          <description>No Description</description>
          <addressOffset>0x088</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>STARTMODE</name>
              <description>Start Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MANUAL</name>
                  <description>Counting starts as soon as ENABLE=1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START_TRIGGER</name>
                  <description>Counting starts when the start-trigger event occurs</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPMODE</name>
              <description>Stop Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MANUAL</name>
                  <description>When writing a 1, stops the counter advancing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_TRIGGER</name>
                  <description>When stop trigger is active, stops the counter advancing</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPARE</name>
                  <description>When the count reaches the value programmed in EVENTCNTRCOMPARE, stops the counter advancing</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COUNTMODE</name>
              <description>Count Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Increment on every clock cycle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START_TRIGGER</name>
                  <description>Increment on every start-trigger event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_TRIGGER</name>
                  <description>Increment on every stop-trigger event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL_TRIGGER</name>
                  <description>Increment on either every start- or stop-trigger event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
