NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32ZG23/EFR32ZG23A010F512GM48.svd
        <register>
          <name>DIVCTRL</name>
          <description>No Description</description>
          <addressOffset>0x03C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>LODIVFREQCTRL</name>
              <description>Frequency division</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LODIV1</name>
                  <description>Divide LO frequency by 1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV2</name>
                  <description>Divide LO frequency by 2.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV3</name>
                  <description>Divide LO frequency by 3.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV4</name>
                  <description>Divide LO frequency by 4.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV5</name>
                  <description>Divide LO frequency by 5.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV7</name>
                  <description>Divide LO frequency by 7.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV6</name>
                  <description>Divide LO frequency by 6.</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV8</name>
                  <description>Divide LO frequency by 8.</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV10</name>
                  <description>Divide LO frequency by 10.</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV14</name>
                  <description>Divide LO frequency by 14.</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV9</name>
                  <description>Divide LO frequency by 9.</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV12</name>
                  <description>Divide LO frequency by 12.</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV15</name>
                  <description>Divide LO frequency by 15.</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV16</name>
                  <description>Divide LO frequency by 16.</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV20</name>
                  <description>Divide LO frequency by 20.</description>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV18</name>
                  <description>Divide LO frequency by 18.</description>
                  <value>155</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LODIV24</name>
                  <description>Divide LO frequency by 24.</description>
                  <value>156</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHCTRL</name>
          <description>No Description</description>
          <addressOffset>0x040</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>CHNO</name>
              <description>Channel number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHSP</name>
          <description>No Description</description>
          <addressOffset>0x044</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>
          <fields>
            <field>
              <name>CHSP</name>
              <description>Channel spacing</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALOFFSET</name>
          <description>No Description</description>
          <addressOffset>0x048</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00007FFF</resetMask>
          <fields>
            <field>
              <name>CALOFFSET</name>
              <description>Carrier calibration offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VCOTUNING</name>
          <description>No Description</description>
          <addressOffset>0x04C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00008400</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>VCOTUNING</name>
              <description>VCO capacitor array calibration value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCAPSEL</name>
              <description>VCO varactor cap select</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VCOGAIN</name>
          <description>No Description</description>
          <addressOffset>0x058</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000077</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>VCOKVCOARSE</name>
              <description>VCO varactor coarse gain setting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCOKVFINE</name>
              <description>VCO varactor fine gain setting</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>No Description</description>
          <addressOffset>0x078</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000237</resetMask>
          <fields>
            <field>
              <name>LOCKED</name>
              <description>Synthesizer locked Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNLOCKED</name>
              <description>Synthesizer unlocked Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYRDY</name>
              <description>Synthesizer ready Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCOHIGH</name>
              <description>VCO high voltage Interrupt Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCOLOW</name>
              <description>VCO low voltage Interrupt Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCNTDONE</name>
              <description>LOCNT measurement done Interrupt Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEN</name>
          <description>No Description</description>
          <addressOffset>0x084</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000237</resetMask>
          <fields>
            <field>
              <name>LOCKED</name>
              <description>LOCKED Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNLOCKED</name>
              <description>UNLOCKED Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYRDY</name>
              <description>CAPCALDONE Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCOHIGH</name>
              <description>VCOHIGH Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VCOLOW</name>
              <description>VCOLOW Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCNTDONE</name>
              <description>LOCNTDONE Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCNTCTRL</name>
          <description>No Description</description>
          <addressOffset>0x088</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable LO Counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>LO counter is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>LO counter is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLEAR</name>
              <description>Clear LO Counter</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Do not clear LO counter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Clear LO counter</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RUN</name>
              <description>Run LO Counter</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Do not run LO counter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Run LO counter</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>READ</name>
              <description>Read LO Counter</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>LOCOUNT register read returns all 0's</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>LOCOUNT register read returns count value</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NUMCYCLE</name>
              <description>Number of Clock Cycles to Run LO Counter</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_2</name>
                  <description>Set count length to 2 XO clock cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_4</name>
                  <description>Set count length to 4 XO clock cycles</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_8</name>
                  <description>Set count length to 8 XO clock cycles</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_16</name>
                  <description>Set count length to 16 XO clock cycles</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_32</name>
                  <description>Set count length to 32 XO clock cycles</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_64</name>
                  <description>Set count length to 64 XO clock cycles</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_128</name>
                  <description>Set count length to 128 XO clock cycles</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_256</name>
                  <description>Set count length to 256 XO clock cycles</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_512</name>
                  <description>Set count length to 512 XO clock cycles</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_1024</name>
                  <description>Set count length to 1024 XO clock cycles</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_2048</name>
                  <description>Set count length to 2048 XO clock cycles</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_4096</name>
                  <description>Set count length to 4096 XO clock cycles</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_8192</name>
                  <description>Set count length to 8192 XO clock cycles</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCNTOVERRIDEEN</name>
              <description>Enable manual override of CLEAR and RUN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable manual override</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable manual override</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCNTMANCLEAR</name>
              <description>Manual Control of LO counter CLEAR</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOCLEAR</name>
                  <description>Don't clear LO counter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Clear LO counter</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCNTMANRUN</name>
              <description>Manual Control of the LO counter RUN</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORUN</name>
                  <description>Don't initiate start/stop LO counter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>Initiate start/stop of LO counter</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCALRUNCLKEN</name>
              <description>Enable FCAL run pulse counter clock</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Don't enable clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCNTSTATUS</name>
          <description>No Description</description>
          <addressOffset>0x08C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>
          <fields>
            <field>
              <name>LOCOUNT</name>
              <description>LO Counter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>LO Counter is Busy</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCNTTARGET</name>
          <description>No Description</description>
          <addressOffset>0x090</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0007FFFF</resetMask>
          <fields>
            <field>
              <name>TARGET</name>
              <description>LO Counter Measurement Target</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MMDDENOMINIT</name>
          <description>No Description</description>
          <addressOffset>0x094</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07FFFFFF</resetMask>
          <fields>
            <field>
              <name>DENOMINIT0</name>
              <description>Initial mmd_denom value 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DENOMINIT1</name>
              <description>Initial mmd_denom value 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DENOMINIT2</name>
              <description>Initial mmd_denom value 2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
